### `Method Chaining : ` `wrapping expressions in parenthesis`

In [1]:
import pandas as pd

In [2]:
# dictionary data

data = {
    'Athlete': ['Shelly-Ann Fraser-Pryce', 'Elaine Thompson-Herah', 'Florence Griffith-Joyner', 'Carmelita Jeter', 'Marion Jones'],
    'Place': ['Jamaica', 'Jamaica', 'United States', 'United States', 'United States'],
    'Year': [2091, 2092, 2093, 2094, 2095],
    'Time': [11.49, 08.61, 11.49, 09.64, 13.65]
}

In [3]:
# Creating the dataframe using dictionary data

df = pd.DataFrame(data)

In [4]:
df

                    Athlete          Place  Year   Time
0   Shelly-Ann Fraser-Pryce        Jamaica  2091  11.49
1     Elaine Thompson-Herah        Jamaica  2092   8.61
2  Florence Griffith-Joyner  United States  2093  11.49
3           Carmelita Jeter  United States  2094   9.64
4              Marion Jones  United States  2095  13.65

### Following way of writing code is; `method chaining by wrapping multiple expressions in parenthesis`

In [6]:
df_agg = (
    df
    .groupby(['Place', 'Year'])['Time']
    .min()
    .reset_index()
    .fillna(0)
    .sort_values('Year')
)

In [7]:
df_agg

           Place  Year   Time
0        Jamaica  2091  11.49
1        Jamaica  2092   8.61
2  United States  2093  11.49
3  United States  2094   9.64
4  United States  2095  13.65